[{"description":"Read the definitive edition of Bilbo Baggins’ adventures in middle-earth in this classic bestseller behind this year’s biggest movie. The Hobbit is a tale of high adventure, undertaken by a company of dwarves in search of dragon-guarded gold. A reluctant partner in this perilous quest is Bilbo Baggins, a comfort-loving unambitious hobbit, who surprises even himself by his resourcefulness and skill as a burglar. Encounters with trolls, goblins, dwarves, elves and giant spiders, conversations with the dragon, Smaug, and a rather unwilling presence at the Battle of Five Armies are just some of the adventures that befall Bilbo. Bilbo Baggins has taken his place among the ranks of the immortals of children’s fiction. Written by Professor Tolkien for his own children, The Hobbit met with instant critical acclaim when published.","title":"The Hobbit","authors":["J. R. R. Tolkien"],"year":"2016","rating":4.5,"image":"http://books.google.com/books/content?id=j2uGDAAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"A great modern classic and the prelude to The Lord of the Rings. Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum. “A glorious account of a magnificent adventure, filled with suspense and seasoned with a quiet humor that is irresistible . . . All those, young or old, who love a fine adventurous tale, beautifully told, will take The Hobbit to their hearts.” – New York Times Book Review","title":"The Hobbit","authors":["J.R.R. Tolkien"],"year":"2012","rating":4.5,"image":"http://books.google.com/books/content?id=pD6arNyKyi8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Exclusive to this Enhanced version of the eBook are recently discovered audio recordings by J.R.R. Tolkien, and new high-resolution colour images of all of Tolkien’s illustrations for the book, many of which are also included in their earlier black-and-white versions and can be revealed by a simple swipe of the screen.","title":"The Hobbit (Enhanced Edition)","authors":["J. R. R. Tolkien"],"year":"2011","rating":4.5,"image":"http://books.google.com/books/content?id=rIqOaeTx074C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"The Hobbit is a tale of high adventure, undertaken by a company of dwarves in search of dragon-guarded gold. A reluctant partner in this perilous quest is Bilbo Baggins, a comfort-loving, unambitious hobbit.","title":"The Hobbit, Or, There and Back Again","authors":["John Ronald Reuel Tolkien"],"year":"1999","rating":4,"image":"http://books.google.com/books/content?id=-pOnG_VCzIsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"The prequel to the epic fantasy saga The Lord of the Rings chronicles the adventures of the inhabitants of Middle-earth and of Bilbo Baggins, the hobbit who brought home to The Shire the One Ring of Power. Reissue.","title":"The Hobbit Or There and Back Again","authors":["J. R. R. Tolkien","John Ronald Reuel Tolkien"],"year":"1982","rating":4,"image":"http://books.google.com/books/content?id=JocrAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"At the 2013 \"Celebrating The Hobbit\" conference at Valparaiso University--marking the 75th anniversary of the book's publication and the first installment of Peter Jackson's Hobbit movies--two plenary papers were presented: \"Anchoring the Myth: The Impact of The Hobbit on Tolkien's Legendarium\" by John D. Rateliff provided numerous examples of The Hobbit's influence on Tolkien's legendarium; and \"Tolkien's French Connections\" by Verlyn Flieger discussed French influences on the development of Bilbo Baggins and his adventures. In discussions with the plenary speakers and other presenters, it became apparent that a book focusing on how The Hobbit influenced the subsequent development of Tolkien's legendarium was sorely needed. This collection of 15 previously unpublished essays fills that need. With Rateliff's and Flieger's papers included, the book presents two chapters on the Evolution of the Dwarven Race, two chapters on Durin's Day examining the Dwarven lunar calendar, and 11 chapters on themes exploring various topics on influences and revisions between The Hobbit and Tolkien's legendarium.","title":"The Hobbit and Tolkien's Mythology","authors":["Bradford Lee Eden"],"year":"2014","rating":3.5,"image":"http://books.google.com/books/content?id=ariQBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Bilbo Baggins enjoys a quiet and contented life, with no desire to travel far from the comforts of home; then one day the wizard Gandalf and a band of dwarves arrive unexpectedly and enlist his services - as a burglar - on a dangerous expedition to raid the treasure-hoard of Smaug the dragon. Bilbo's life is never to be the same again.The Hobbit became an instant success when it was first published in 1937, and more than 60 years later Tolkien's epic tale of elves, dwarves, trolls, goblins, myth, magic and adventure, with its reluctant hero Bilbo Baggins, has lost none of its appeal.Bilbo Baggins has taken his place among the ranks of the immortals of children's fiction. Written by Professor Tolkien for his own children, The Hobbit met with instant critical acclaim when published - it was the Harry Potter of its generation. With new Lord of the Rings movies around the corner, this special Children's edition is designed to put the book back where it belongs - at the top of every child's 'must-read' list.","title":"The Hobbit","authors":["John Ronald Reuel Tolkien","Alan Lee"],"year":"2008","rating":4,"image":"http://books.google.com/books/content?id=F2xu1nZOzKoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"A University of Oxford literature lecturer explores the chief influences on Tolkien's work, including his youth in the West Midlands, his World War I experiences and his interest in Scandinavian mythology, to explore the sources of his creative achievements.","title":"There and Back Again","authors":["Mark Atherton"],"year":"2012","rating":2,"image":"http://books.google.com/books/content?id=39uvMgwDEDgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"Reveals the Christian elements that lie at the center of \"The Hobbit,\" explaining how Tolkien incorporated his faith into his classic literary work.","title":"The Christian World of The Hobbit","authors":["Devin Brown"],"year":"2012","rating":4.5,"image":"http://books.google.com/books/content?id=QMZ-SpsAuasC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"The Hobbit is a tale of high adventure, undertaken by a company of dwarves in search of dragon-guarded gold. A reluctant partner in this quest is Bilbo Baggins. Encounters with trolls, goblins, & the dragon are just some of the hazards that befall him.","title":"The Hobbit, Or, There and Back Again","authors":["John Ronald Reuel Tolkien"],"year":"1996","rating":4,"image":"http://books.google.com/books/content?id=Ts_gmPmzxtUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"The host of the popular podcast The Tolkien Professor provides an in-depth tour of The Hobbit, detailing the secrets and stories behind the characters within the prelude to The Lord of the Rings. 30,000 first printing.","title":"Exploring J.R.R. Tolkien's The Hobbit","authors":["Corey Olsen"],"year":"2012","rating":4,"image":"http://books.google.com/books/content?id=KY0BDObXftUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Bilbo Baggins and his company of dwarves battle against evil orcs and wargs in order to recapture the lost Kingdom of Erebor.","title":"The Hobbit","authors":["Paddy Kempshall"],"year":"2012","rating":3,"image":"http://books.google.com/books/content?id=Wy0svf_7NzsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Enter Bilbo Baggins’ world through exclusive interviews with director Peter Jackson, Martin Freeman, Ian McKellen and all the principal cast and filmmakers, who share film-making secrets and tales of what it was actually like making movie magic in Middle-earth. Lavishly illustrated with hundreds of behind-the-scenes photos of the actors, locations, sets, creatures and costumes, The Hobbit: An Unexpected Journey Official Movie Guide has been produced in collaboration with the filmmakers who have brought J.R.R. Tolkien’s classic novel into breathtaking three-dimensional life.","title":"The Hobbit: An Unexpected Journey Official Movie Guide","authors":["Brian Sibley"],"year":"2012","rating":3.5,"image":"http://books.google.com/books/content?id=e5srNGZN70wC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"John Ronald Reuel Tolkien (1892-1973) was a brilliant writer who continues to leave his imaginative imprint on the mind and hearts of readers. He was once called the \"creative equivalent of a people,\" and for more than sixty years his Middle-earth tales have captivated and delighted readers of all ages from all over the world. The Hobbit has long been recognized as a children's fantasy classic, and the heroic romance the Lord of the Rings has been called the most influential story of all time. These stories have sold over 150 million copies worldwide and have been translated into over forty languages, and they, along with works such as the Silmarillion and the History of Middle-Earth, have convinced scores of readers and critics that Tolkien is the master writer of fantasy. Whether you've been a fan for years or you've just recently been hooked by the blockbuster Lord of the Rings movies, \"I Am in Fact a Hobbit\" is an excellent starting point into the life and work of J. R. R. Tolkien. Book jacket.","title":"I Am in Fact a Hobbit","authors":["Perry C. Bramlett"],"year":"2003","rating":5,"image":"http://books.google.com/books/content?id=8ef3-s6fixIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"A visual companion to the film \"The Hobbit: An Unexpected Journey\" offers insights into the world of Middle-Earth and includes character profiles, bestiaries, and notes on the places of Middle-Earth.","title":"The Hobbit","authors":["Jude Fisher"],"year":"2012","rating":4.5,"image":"http://books.google.com/books/content?id=H8ON-dTgQQYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"This book situates The Hobbit and the rest of Tolkien's writing in the context of Old English riddling culture and more modern day examples, setting out to solve the novel's riddles in original ways.","title":"The Riddles of The Hobbit","authors":["Adam Roberts"],"year":"2013","rating":3.5,"image":"http://books.google.com/books/content?id=8KdEAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Describes the historical and literary background of \"The Hobbit,\" and offers an interpretation of its major themes","title":"The Hobbit","authors":["William Howard Green"],"year":"1995","rating":3.5,"image":"http://books.google.com/books/content?id=iKonAQAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Fantasy fiction. The first ever illustrated paperback of part one of Tolkien's epic masterpiece, The Lord of the Rings, featuring 19 colour paintings by Alan Lee.","title":"The Fellowship of the Ring","authors":["John Ronald Reuel Tolkien","Alan Lee"],"year":"2008","rating":4,"image":"http://books.google.com/books/content?id=5QRZ4z6A1WwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"Chronicles the adventures of Bilbo Baggins, who embarks on a quest to reclaim stolen treasure from the dragon Smaug, along with his dwarve companions and the wizard Gandalf, and unwittingly returns to the Shire with a Ring of Power.","title":"The Hobbit","authors":["Chuck Dixon","John Ronald Reuel Tolkien"],"year":"2001","rating":4.5,"image":"http://books.google.com/books/content?id=yZSLAAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Features over eight hundred questions about such aspects of \"The Hobbit\" as its settings, villains, and Bilbo himself, as well as the movies and other adaptations the book inspired.","title":"The Unofficial Hobbit Trivia Challenge","authors":["Nick Hurwitch"],"year":"2012","rating":5,"image":"http://books.google.com/books/content?id=CmtM3MXVf1kC&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"Seminar paper from the year 2006 in the subject English Language and Literature Studies - Literature, grade: 1,3, http://www.uni-jena.de/ (Institut für Anglistik/Amerikanistik), course: Mythology for England, 9 entries in the bibliography, language: English, abstract: Narrator. Storyteller. When thinking about a person who narrates or tells a story, one of the first impressions that usually come to mind is that of a man or a woman, sitting in a well-worn rocking chair, surrounded by children who listen with rapt attention to tales of dragons and princesses. This image, depicting the classical oral storyteller as he has been known since ancient times, may at first glance have little to do with the narrative voice of a written work of literature. However, the oral storyteller and the narrator of a novel have many things in common. They both mediate the story to an audience - either to a real one that is physically present or to an impersonal reader of a book, and, depending on their technique, they are able to recount a story in a number of ways. There are many different approaches to narrating a tale. A narrator can remain mostly in the background and simply relate the story to his readers or listeners, without any commentary of other interruptions, or he can narrate the story through his or her own eyes, using the first person singular and thus creating an intensely personal atmosphere and letting the audience experience the adventures almost first-hand. However, sometimes the narrator can become actively involved into the tale, but without actually being a part of it. He adds his own thoughts and opinions to the story, he speaks to the readers himself and actively guides them through his story. Such a narrator is also present in Tolkien’s novel The Hobbit. So the topic of this paper will be to analyse the narrator of The Hobbit, and to determine his most characteristic features. It will be illustrated on the following pages that the narrator of The Hobbit is an intrusive authorial narrator who frequently comments on and judges the characters as well as the unfolding events, who is acutely aware of himself, his audience and his role as a storyteller, and who addressed his readers in a direct way and actively leads them through his narrative. Furthermore it will be determined whether there are any obvious changes to the narrative voice in the last chapters of the book, which were written over three years after the rest of the novel.","title":"The Voice of the Narrator in J.R.R. Tolkien's The Hobbit","authors":["Nadja Litschko"],"year":"2006","rating":3.5,"image":"http://books.google.com/books/content?id=dLgnpbXuQuIC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Chronicles the adventures of Bilbo Baggins, who embarks on a quest to reclaim stolen treasure from the dragon Smaug, along with his dwarve companions and the wizard Gandalf, and unwittingly returns to the Shire with a Ring of Power.","title":"The Hobbit","authors":["Charles Dixon","J. R. R. Tolkien"],"year":"2001","rating":3.5,"image":"http://books.google.com/books/content?id=tFWlPwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"The Lord of the Rings trilogy has delighted millions of fans worldwide in book and movie form. With the theatrical release of the two-part film The Hobbit slated for 2012 and 2013, attention will once again turn to J. R. R. Tolkien's classic works. In a culture where truth is relative and morality is viewed as old-fashioned, we welcome the chance to view the world through hobbit eyes: we have free will, our choices matter, and living a morally heroic life is possible. In this engaging and thought-provoking book, Tolkien expert Matthew Dickerson shows how a Christian worldview and Christian themes undergird Tolkien's Middle-earth writings and how they are fundamentally important to understanding his vision. This revised and expanded edition of Following Gandalf includes new material on torture, social justice, and the importance of the body.","title":"A Hobbit Journey","authors":["Matthew Dickerson"],"year":"2012","rating":3,"image":"http://books.google.com/books/content?id=-3HK5oU_OPgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"The unforgettable world of Middle-earth returned to theaters in Peter Jackson's trilogy of films adapting the enduringly popular masterpiece The Hobbit by J. R. R. Tolkien. Illustrating the breathtaking visuals and undeniable global impact of the films, The Hobbit: The Definitive Movie Posters features iconic and rare posters created for the extraordinary trilogy. Filled with stunning poster art from The Hobbit: An Unexpected Journey, The Hobbit: The Desolation of Smaug, and The Hobbit: The Battle of the Five Armies, this indispensable gallery perfectly captures the spirit of this beloved and remarkable trilogy.","title":"The Hobbit","authors":["Insight Editions"],"year":"2015","rating":3.5,"image":"http://books.google.com/books/content?id=Qw6PoAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"title":"J. R. R. Tolkien's the Hobbit","authors":["John Ronald Reuel Tolkien","Patricia Gray"],"year":"1967","rating":4,"image":"http://books.google.com/books/content?id=6MCbciiEnboC&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"Contains over fifteen essays that discuss philosophical topics in J.R.R. Tolkien's \"The Hobbit\" providing new insights into the characters and plot.","title":"The Hobbit and Philosophy","authors":["Gregory Bassham","Eric Bronson"],"year":"2012","rating":4,"image":"http://books.google.com/books/content?id=33HUiYwuBxQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"Discover the Christian meaning in The Hobbit. In Bilbo's Journey go beyond the dragons, dwarves, and elves, and discover the surprisingly deep meaning of J.R.R. Tolkien's classic novel The Hobbit. Bilbo's quest to find and slay the dragon Smaug is a riveting tale of daring and heroism, but as renowned Tolkien scholar Joseph Pearce shows, it is not simply Bilbo's journey, it is our journey too. It is the Christian journey of self-sacrifice out of love for others, and abandonment to providence and grace. In Bilbo's Journey: Discovering the Hidden Meaning of The Hobbit you will relive the excitement of Tolkien's classic tale, while discovering the profound Christian meaning that makes The Hobbit a truly timeless adventure. The audiobook edition of Bilbo's Journey is read by Kevin O'Brien.","title":"Bilbo's Journey","authors":["Joseph Pearce"],"year":"2012","rating":3.5,"image":"http://books.google.com/books/content?id=mBSsCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[]},{"description":"The History of the Hobbit presents for the first time, in two volumes, the complete unpublished text of the original manuscript of J.R.R.Tolkien's The Hobbit, accompanied by John Rateliff's lively and informative account of how the book came to be written and published. As well as recording the numerous changes made to the story both before and after publication, it examines - chapter-by-chapter - why those changes were made and how they reflect Tolkien's ever-growing concept of Middle-earth.The Hobbit was first published on 21 September 1937. Like its successor, The Lord of the Rings, it is a story that \"grew in the telling\", and many characters and story threads in the published text are completely different from what Tolkien first wrote to read aloud to his young sons as part of their \"fireside reads\".As well as reproducing the original version of one of literature's most famous stories, both on its own merits and as the foundation for The Lord of the Rings, this new book includes many little-known illustrations and previously unpublished maps for The Hobbit by Tolkien himself. Also featured are extensive annotations and commentaries on the date of composition, how Tolkien's professional and early mythological writings influenced the story, the imaginary geography he created, and how Tolkien came to revise the book years after publication to accommodate events in The Lord of the Rings.Like Christopher Tolkien's The History of The Lord of the Rings before it, this is a thoughtful yet exhaustive examination of one of the most treasured stories in English literature. Long overdue for a classic book now celebrating 70 years in print, this companion edition offers fascinating new insights for those who have grown up with this enchanting tale, and will delight those who are about to enter Bilbo's round door for the first time.","title":"The History of the Hobbit","authors":["John D. Rateliff"],"year":"2008","rating":4.5,"image":"http://books.google.com/books/content?id=7QMLmRPUkCEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"title":"Tolkien: the Lord of the rings, The Hobbit","authors":["J. R. R. Tolkien"],"year":"1979","rating":3.5,"image":"http://books.google.com/books/content?id=g8RMxrDNk68C&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Journey deeper into the magical world of the hobbit, Bilbo Baggins, through exclusive interviews with director Peter Jackson, Martin Freeman, Orlando Bloom and principal filmmakers and new cast members, including Stephen Fry as the Master of Lake-town, Evangeline Lilly, who plays Tauriel the Elf, and Benedict Cumberbatch, who reveals film-making secrets about playing the dragon, Smaug. Richly illustrated with a treasure trove of behind-the-scenes photos of the actors, creatures and costumes, and numerous special effects scenes, this essential guide is an indispensable companion to the second film in the award-winning trilogy.","title":"The Hobbit: The Desolation of Smaug Official Movie Guide","authors":["Brian Sibley"],"year":"2013","rating":3.5,"image":"http://books.google.com/books/content?id=3WEGAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[]},{"description":"The Hobbit by J.R.R. Tolkien - It's the book that started it all! Though not as epic as the series that came after it, there are still enough characters, settings and plots to make a companion nice to have. BookCaps can help! This companion to the book provides character, plot and chapter summaries. BookCap Study Guides do not contain text from the actual book, and are not meant to be purchased as alternatives to reading the book.","title":"The Hobbit (Study Guide)","authors":["BookCaps Study Guides Staff"],"year":"2011","rating":5,"image":"http://books.google.com/books/content?id=OZI4edE6nSMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Bilbo Baggins, now in possession of the One Ring, travels through the Misty Mountains with Gandalf and his Dwarf friends to get their gold back from the dragon Smaug.","title":"The Hobbit","authors":["Houghton Mifflin Harcourt"],"year":"2013","rating":3.5,"image":"http://books.google.com/books/content?id=jLogAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"J.R.R. Tolkien's novel was met with international acclaim upon its publication in 1937, given its adventurous plot, elements of high fantasy, and lovable protagonist, Bilbo Baggins. This compilation of essays closely studies the classic staple of children's literature by examining some of its themes-such as maturation and overcoming greed-exploring the world of Middle-earth, and comparing/contrasting the text with its popular sequel, The Lord of the Rings.","title":"Critical Insights","authors":["Stephen Potts"],"year":"2016","rating":3.5,"image":"http://books.google.com/books/content?id=PbcVvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"title":"The Hobbit: The Enchanting Prelude to The Lord of the Rings","authors":["J R R Tolkien"],"year":"1973","rating":3.5,"image":"http://books.google.com/books/content?id=MMo67YKudBEC&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"description":"The classic bestseller behind this year's biggest movie, this film tie-in edition features the complete story of Bilbo Baggins' adventures in Middle-earth as shown in the film trilogy, with a striking cover image from Peter Jackson's film adaptation and drawings and maps by J.R.R. Tolkien.","title":"The Hobbit","authors":["J. R. R. Tolkien"],"year":"2014","rating":4.5,"image":"http://books.google.com/books/content?id=0iT4oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"}]},{"description":"The Hobbit: An Unexpected Journey Chronicles - Art & Design is packed with more than 1,000 images of concept artwork, photographs and development paintings by the artists working behind the scenes to bring Middle-earth to life, each of whom provides detailed and entertaining commentary that reveals the story behind the vision.As a bonus feature unique to this book, there is a special fold-out map printed in glow-in-the-dark ink and a three-page fold-out replica of Bilbo's contract.Compiled by Weta Workshop senior concept designer Daniel Falconer, this is the first in a series of lavish hardback books written and designed by the award-winning team at Weta, who are working closely with the production team to guarantee that these books will be bursting with insider information and stunning visual imagery.","title":"The Hobbit","authors":["J. R. R. Tolkien","Daniel Falconer","Weta Workshop (Firm)"],"year":"2012","rating":3.5,"image":"http://books.google.com/books/content?id=nFcduwAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Examines artistic interpretations of Tolkien's fantasy world, including movie stills, theatrical performances, games, and comic books, and features the lost art of Mary Fairburn, whose paintings were favored by Tolkien himself.","title":"Middle-earth Envisioned","authors":["Brian J. Robb","Paul Simpson"],"year":"2013","rating":3.5,"image":"http://books.google.com/books/content?id=Nds_AQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]},{"title":"The Hobbit","authors":["J R R Tolkien","Ruth Perry","David Rogers","Allan J Friedman"],"year":"1972","rating":3.5,"image":"http://books.google.com/books/content?id=wFMO7R-qvDUC&printsec=frontcover&img=1&zoom=1&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Enter the world of the hobbit, Bilbo Baggins, and the Dwarves as they continue their journey. This new book in the Hobbit range includes different fact files and activities designed to inform the reader about the story and its characters and invite them to participate using the stickers. Includes four pages of full-color photo stickers featuring the characters, and creatures from the films.","title":"The Hobbit: The Desolation of Smaug Sticker Book","authors":["Gemma Barder"],"year":"2013","rating":3.5,"image":"http://books.google.com/books/content?id=arsgAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Google Play","link":"https://play.google.com/books"},{"store":"iBooks","link":"https://itunes.apple.com/us/genre/books/id38?mt=11"}]},{"description":"Indulges readers with an exploration of the spiritual significance of J.R.R. Tolkien's famous children's classic.","title":"Finding God in the Hobbit","authors":["Jim Ware"],"year":"2006","rating":4.5,"image":"http://books.google.com/books/content?id=N_0VhzQKIIAC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api","links":[{"store":"Amazon","link":"https://www.amazon.com/books-used-books-textbooks/"},{"store":"Google Play","link":"https://play.google.com/books"}]}]
